GopalSaraf/Practicals/PSDL/include/proc/pic18f25q43.inc
// Register: SPI1STATUS
#define SPI1STATUS SPI1STATUS
SPI1STATUS                               equ 0087h
// bitfield definitions
SPI1STATUS_RXBF_POSN                     equ 0000h
SPI1STATUS_RXBF_POSITION                 equ 0000h
SPI1STATUS_RXBF_SIZE                     equ 0001h
SPI1STATUS_RXBF_LENGTH                   equ 0001h
SPI1STATUS_RXBF_MASK                     equ 0001h
SPI1STATUS_CLRBF_POSN                    equ 0002h
SPI1STATUS_CLRBF_POSITION                equ 0002h
SPI1STATUS_CLRBF_SIZE                    equ 0001h
SPI1STATUS_CLRBF_LENGTH                  equ 0001h
SPI1STATUS_CLRBF_MASK                    equ 0004h
SPI1STATUS_RXRE_POSN                     equ 0003h
SPI1STATUS_RXRE_POSITION                 equ 0003h
SPI1STATUS_RXRE_SIZE                     equ 0001h
SPI1STATUS_RXRE_LENGTH                   equ 0001h
SPI1STATUS_RXRE_MASK                     equ 0008h
SPI1STATUS_TXBE_POSN                     equ 0005h
SPI1STATUS_TXBE_POSITION                 equ 0005h
SPI1STATUS_TXBE_SIZE                     equ 0001h
SPI1STATUS_TXBE_LENGTH                   equ 0001h
SPI1STATUS_TXBE_MASK                     equ 0020h
SPI1STATUS_TXWE_POSN                     equ 0007h
SPI1STATUS_TXWE_POSITION                 equ 0007h
SPI1STATUS_TXWE_SIZE                     equ 0001h
SPI1STATUS_TXWE_LENGTH                   equ 0001h
SPI1STATUS_TXWE_MASK                     equ 0080h
SPI1STATUS_SPI1RXBF_POSN                 equ 0000h
SPI1STATUS_SPI1RXBF_POSITION             equ 0000h
SPI1STATUS_SPI1RXBF_SIZE                 equ 0001h
SPI1STATUS_SPI1RXBF_LENGTH               equ 0001h
SPI1STATUS_SPI1RXBF_MASK                 equ 0001h
SPI1STATUS_SPI1CLRBF_POSN                equ 0002h
SPI1STATUS_SPI1CLRBF_POSITION            equ 0002h
SPI1STATUS_SPI1CLRBF_SIZE                equ 0001h
SPI1STATUS_SPI1CLRBF_LENGTH              equ 0001h
SPI1STATUS_SPI1CLRBF_MASK                equ 0004h
SPI1STATUS_SPI1RXRE_POSN                 equ 0003h
SPI1STATUS_SPI1RXRE_POSITION             equ 0003h
SPI1STATUS_SPI1RXRE_SIZE                 equ 0001h
SPI1STATUS_SPI1RXRE_LENGTH               equ 0001h
SPI1STATUS_SPI1RXRE_MASK                 equ 0008h
SPI1STATUS_SPI1TXBE_POSN                 equ 0005h
SPI1STATUS_SPI1TXBE_POSITION             equ 0005h
SPI1STATUS_SPI1TXBE_SIZE                 equ 0001h
SPI1STATUS_SPI1TXBE_LENGTH               equ 0001h
SPI1STATUS_SPI1TXBE_MASK                 equ 0020h
SPI1STATUS_SPI1TXWE_POSN                 equ 0007h
SPI1STATUS_SPI1TXWE_POSITION             equ 0007h
SPI1STATUS_SPI1TXWE_SIZE                 equ 0001h
SPI1STATUS_SPI1TXWE_LENGTH               equ 0001h
SPI1STATUS_SPI1TXWE_MASK                 equ 0080h

// Register: SPI1TWIDTH
#define SPI1TWIDTH SPI1TWIDTH
SPI1TWIDTH                               equ 0088h
// bitfield definitions
SPI1TWIDTH_TWIDTH_POSN                   equ 0000h
SPI1TWIDTH_TWIDTH_POSITION               equ 0000h
SPI1TWIDTH_TWIDTH_SIZE                   equ 0003h
SPI1TWIDTH_TWIDTH_LENGTH                 equ 0003h
SPI1TWIDTH_TWIDTH_MASK                   equ 0007h
SPI1TWIDTH_TWIDTH0_POSN                  equ 0000h
SPI1TWIDTH_TWIDTH0_POSITION              equ 0000h
SPI1TWIDTH_TWIDTH0_SIZE                  equ 0001h
SPI1TWIDTH_TWIDTH0_LENGTH                equ 0001h
SPI1TWIDTH_TWIDTH0_MASK                  equ 0001h
SPI1TWIDTH_TWIDTH1_POSN                  equ 0001h
SPI1TWIDTH_TWIDTH1_POSITION              equ 0001h
SPI1TWIDTH_TWIDTH1_SIZE                  equ 0001h
SPI1TWIDTH_TWIDTH1_LENGTH                equ 0001h
SPI1TWIDTH_TWIDTH1_MASK                  equ 0002h
SPI1TWIDTH_TWIDTH2_POSN                  equ 0002h
SPI1TWIDTH_TWIDTH2_POSITION              equ 0002h
SPI1TWIDTH_TWIDTH2_SIZE                  equ 0001h
SPI1TWIDTH_TWIDTH2_LENGTH                equ 0001h
SPI1TWIDTH_TWIDTH2_MASK                  equ 0004h

// Register: SPI1BAUD
#define SPI1BAUD SPI1BAUD
SPI1BAUD                                 equ 0089h
// bitfield definitions
SPI1BAUD_BAUD_POSN                       equ 0000h
SPI1BAUD_BAUD_POSITION                   equ 0000h
SPI1BAUD_BAUD_SIZE                       equ 0008h
SPI1BAUD_BAUD_LENGTH                     equ 0008h
SPI1BAUD_BAUD_MASK                       equ 00FFh
SPI1BAUD_BAUD0_POSN                      equ 0000h
SPI1BAUD_BAUD0_POSITION                  equ 0000h
SPI1BAUD_BAUD0_SIZE                      equ 0001h
SPI1BAUD_BAUD0_LENGTH                    equ 0001h
SPI1BAUD_BAUD0_MASK                      equ 0001h
SPI1BAUD_BAUD1_POSN                      equ 0001h
SPI1BAUD_BAUD1_POSITION                  equ 0001h
SPI1BAUD_BAUD1_SIZE                      equ 0001h
SPI1BAUD_BAUD1_LENGTH                    equ 0001h
SPI1BAUD_BAUD1_MASK                      equ 0002h
SPI1BAUD_BAUD2_POSN                      equ 0002h
SPI1BAUD_BAUD2_POSITION                  equ 0002h
SPI1BAUD_BAUD2_SIZE                      equ 0001h
SPI1BAUD_BAUD2_LENGTH                    equ 0001h
SPI1BAUD_BAUD2_MASK                      equ 0004h
SPI1BAUD_BAUD3_POSN                      equ 0003h
SPI1BAUD_BAUD3_POSITION                  equ 0003h
SPI1BAUD_BAUD3_SIZE                      equ 0001h
SPI1BAUD_BAUD3_LENGTH                    equ 0001h
SPI1BAUD_BAUD3_MASK                      equ 0008h
SPI1BAUD_BAUD4_POSN                      equ 0004h
SPI1BAUD_BAUD4_POSITION                  equ 0004h
SPI1BAUD_BAUD4_SIZE                      equ 0001h
SPI1BAUD_BAUD4_LENGTH                    equ 0001h
SPI1BAUD_BAUD4_MASK                      equ 0010h
SPI1BAUD_BAUD5_POSN                      equ 0005h
SPI1BAUD_BAUD5_POSITION                  equ 0005h
SPI1BAUD_BAUD5_SIZE                      equ 0001h
SPI1BAUD_BAUD5_LENGTH                    equ 0001h
SPI1BAUD_BAUD5_MASK                      equ 0020h
SPI1BAUD_BAUD6_POSN                      equ 0006h
SPI1BAUD_BAUD6_POSITION                  equ 0006h
SPI1BAUD_BAUD6_SIZE                      equ 0001h
SPI1BAUD_BAUD6_LENGTH                    equ 0001h
SPI1BAUD_BAUD6_MASK                      equ 0040h
SPI1BAUD_BAUD7_POSN                      equ 0007h
SPI1BAUD_BAUD7_POSITION                  equ 0007h
SPI1BAUD_BAUD7_SIZE                      equ 0001h
SPI1BAUD_BAUD7_LENGTH                    equ 0001h
SPI1BAUD_BAUD7_MASK                      equ 0080h

