GopalSaraf/Practicals/PSDL/include/proc/pic18f25q43.inc
// Register: RB3PPS
#define RB3PPS RB3PPS
RB3PPS                                   equ 020Ch
// bitfield definitions
RB3PPS_RB3PPS0_POSN                      equ 0000h
RB3PPS_RB3PPS0_POSITION                  equ 0000h
RB3PPS_RB3PPS0_SIZE                      equ 0001h
RB3PPS_RB3PPS0_LENGTH                    equ 0001h
RB3PPS_RB3PPS0_MASK                      equ 0001h
RB3PPS_RB3PPS1_POSN                      equ 0001h
RB3PPS_RB3PPS1_POSITION                  equ 0001h
RB3PPS_RB3PPS1_SIZE                      equ 0001h
RB3PPS_RB3PPS1_LENGTH                    equ 0001h
RB3PPS_RB3PPS1_MASK                      equ 0002h
RB3PPS_RB3PPS2_POSN                      equ 0002h
RB3PPS_RB3PPS2_POSITION                  equ 0002h
RB3PPS_RB3PPS2_SIZE                      equ 0001h
RB3PPS_RB3PPS2_LENGTH                    equ 0001h
RB3PPS_RB3PPS2_MASK                      equ 0004h
RB3PPS_RB3PPS3_POSN                      equ 0003h
RB3PPS_RB3PPS3_POSITION                  equ 0003h
RB3PPS_RB3PPS3_SIZE                      equ 0001h
RB3PPS_RB3PPS3_LENGTH                    equ 0001h
RB3PPS_RB3PPS3_MASK                      equ 0008h
RB3PPS_RB3PPS4_POSN                      equ 0004h
RB3PPS_RB3PPS4_POSITION                  equ 0004h
RB3PPS_RB3PPS4_SIZE                      equ 0001h
RB3PPS_RB3PPS4_LENGTH                    equ 0001h
RB3PPS_RB3PPS4_MASK                      equ 0010h
RB3PPS_RB3PPS5_POSN                      equ 0005h
RB3PPS_RB3PPS5_POSITION                  equ 0005h
RB3PPS_RB3PPS5_SIZE                      equ 0001h
RB3PPS_RB3PPS5_LENGTH                    equ 0001h
RB3PPS_RB3PPS5_MASK                      equ 0020h
RB3PPS_RB3PPS6_POSN                      equ 0006h
RB3PPS_RB3PPS6_POSITION                  equ 0006h
RB3PPS_RB3PPS6_SIZE                      equ 0001h
RB3PPS_RB3PPS6_LENGTH                    equ 0001h
RB3PPS_RB3PPS6_MASK                      equ 0040h

// Register: RB4PPS
#define RB4PPS RB4PPS
RB4PPS                                   equ 020Dh
// bitfield definitions
RB4PPS_RB4PPS0_POSN                      equ 0000h
RB4PPS_RB4PPS0_POSITION                  equ 0000h
RB4PPS_RB4PPS0_SIZE                      equ 0001h
RB4PPS_RB4PPS0_LENGTH                    equ 0001h
RB4PPS_RB4PPS0_MASK                      equ 0001h
RB4PPS_RB4PPS1_POSN                      equ 0001h
RB4PPS_RB4PPS1_POSITION                  equ 0001h
RB4PPS_RB4PPS1_SIZE                      equ 0001h
RB4PPS_RB4PPS1_LENGTH                    equ 0001h
RB4PPS_RB4PPS1_MASK                      equ 0002h
RB4PPS_RB4PPS2_POSN                      equ 0002h
RB4PPS_RB4PPS2_POSITION                  equ 0002h
RB4PPS_RB4PPS2_SIZE                      equ 0001h
RB4PPS_RB4PPS2_LENGTH                    equ 0001h
RB4PPS_RB4PPS2_MASK                      equ 0004h
RB4PPS_RB4PPS3_POSN                      equ 0003h
RB4PPS_RB4PPS3_POSITION                  equ 0003h
RB4PPS_RB4PPS3_SIZE                      equ 0001h
RB4PPS_RB4PPS3_LENGTH                    equ 0001h
RB4PPS_RB4PPS3_MASK                      equ 0008h
RB4PPS_RB4PPS4_POSN                      equ 0004h
RB4PPS_RB4PPS4_POSITION                  equ 0004h
RB4PPS_RB4PPS4_SIZE                      equ 0001h
RB4PPS_RB4PPS4_LENGTH                    equ 0001h
RB4PPS_RB4PPS4_MASK                      equ 0010h
RB4PPS_RB4PPS5_POSN                      equ 0005h
RB4PPS_RB4PPS5_POSITION                  equ 0005h
RB4PPS_RB4PPS5_SIZE                      equ 0001h
RB4PPS_RB4PPS5_LENGTH                    equ 0001h
RB4PPS_RB4PPS5_MASK                      equ 0020h
RB4PPS_RB4PPS6_POSN                      equ 0006h
RB4PPS_RB4PPS6_POSITION                  equ 0006h
RB4PPS_RB4PPS6_SIZE                      equ 0001h
RB4PPS_RB4PPS6_LENGTH                    equ 0001h
RB4PPS_RB4PPS6_MASK                      equ 0040h

// Register: RB5PPS
#define RB5PPS RB5PPS
RB5PPS                                   equ 020Eh
// bitfield definitions
RB5PPS_RB5PPS0_POSN                      equ 0000h
RB5PPS_RB5PPS0_POSITION                  equ 0000h
RB5PPS_RB5PPS0_SIZE                      equ 0001h
RB5PPS_RB5PPS0_LENGTH                    equ 0001h
RB5PPS_RB5PPS0_MASK                      equ 0001h
RB5PPS_RB5PPS1_POSN                      equ 0001h
RB5PPS_RB5PPS1_POSITION                  equ 0001h
RB5PPS_RB5PPS1_SIZE                      equ 0001h
RB5PPS_RB5PPS1_LENGTH                    equ 0001h
RB5PPS_RB5PPS1_MASK                      equ 0002h
RB5PPS_RB5PPS2_POSN                      equ 0002h
RB5PPS_RB5PPS2_POSITION                  equ 0002h
RB5PPS_RB5PPS2_SIZE                      equ 0001h
RB5PPS_RB5PPS2_LENGTH                    equ 0001h
RB5PPS_RB5PPS2_MASK                      equ 0004h
RB5PPS_RB5PPS3_POSN                      equ 0003h
RB5PPS_RB5PPS3_POSITION                  equ 0003h
RB5PPS_RB5PPS3_SIZE                      equ 0001h
RB5PPS_RB5PPS3_LENGTH                    equ 0001h
RB5PPS_RB5PPS3_MASK                      equ 0008h
RB5PPS_RB5PPS4_POSN                      equ 0004h
RB5PPS_RB5PPS4_POSITION                  equ 0004h
RB5PPS_RB5PPS4_SIZE                      equ 0001h
RB5PPS_RB5PPS4_LENGTH                    equ 0001h
RB5PPS_RB5PPS4_MASK                      equ 0010h
RB5PPS_RB5PPS5_POSN                      equ 0005h
RB5PPS_RB5PPS5_POSITION                  equ 0005h
RB5PPS_RB5PPS5_SIZE                      equ 0001h
RB5PPS_RB5PPS5_LENGTH                    equ 0001h
RB5PPS_RB5PPS5_MASK                      equ 0020h
RB5PPS_RB5PPS6_POSN                      equ 0006h
RB5PPS_RB5PPS6_POSITION                  equ 0006h
RB5PPS_RB5PPS6_SIZE                      equ 0001h
RB5PPS_RB5PPS6_LENGTH                    equ 0001h
RB5PPS_RB5PPS6_MASK                      equ 0040h

// Register: RB6PPS
#define RB6PPS RB6PPS
RB6PPS                                   equ 020Fh
// bitfield definitions
RB6PPS_RB6PPS0_POSN                      equ 0000h
RB6PPS_RB6PPS0_POSITION                  equ 0000h
RB6PPS_RB6PPS0_SIZE                      equ 0001h
RB6PPS_RB6PPS0_LENGTH                    equ 0001h
RB6PPS_RB6PPS0_MASK                      equ 0001h
RB6PPS_RB6PPS1_POSN                      equ 0001h
RB6PPS_RB6PPS1_POSITION                  equ 0001h
RB6PPS_RB6PPS1_SIZE                      equ 0001h
RB6PPS_RB6PPS1_LENGTH                    equ 0001h
RB6PPS_RB6PPS1_MASK                      equ 0002h
RB6PPS_RB6PPS2_POSN                      equ 0002h
RB6PPS_RB6PPS2_POSITION                  equ 0002h
RB6PPS_RB6PPS2_SIZE                      equ 0001h
RB6PPS_RB6PPS2_LENGTH                    equ 0001h
RB6PPS_RB6PPS2_MASK                      equ 0004h
RB6PPS_RB6PPS3_POSN                      equ 0003h
RB6PPS_RB6PPS3_POSITION                  equ 0003h
RB6PPS_RB6PPS3_SIZE                      equ 0001h
RB6PPS_RB6PPS3_LENGTH                    equ 0001h
RB6PPS_RB6PPS3_MASK                      equ 0008h
RB6PPS_RB6PPS4_POSN                      equ 0004h
RB6PPS_RB6PPS4_POSITION                  equ 0004h
RB6PPS_RB6PPS4_SIZE                      equ 0001h
RB6PPS_RB6PPS4_LENGTH                    equ 0001h
RB6PPS_RB6PPS4_MASK                      equ 0010h
RB6PPS_RB6PPS5_POSN                      equ 0005h
RB6PPS_RB6PPS5_POSITION                  equ 0005h
RB6PPS_RB6PPS5_SIZE                      equ 0001h
RB6PPS_RB6PPS5_LENGTH                    equ 0001h
RB6PPS_RB6PPS5_MASK                      equ 0020h
RB6PPS_RB6PPS6_POSN                      equ 0006h
RB6PPS_RB6PPS6_POSITION                  equ 0006h
RB6PPS_RB6PPS6_SIZE                      equ 0001h
RB6PPS_RB6PPS6_LENGTH                    equ 0001h
RB6PPS_RB6PPS6_MASK                      equ 0040h

// Register: RB7PPS
#define RB7PPS RB7PPS
RB7PPS                                   equ 0210h
// bitfield definitions
RB7PPS_RB7PPS0_POSN                      equ 0000h
RB7PPS_RB7PPS0_POSITION                  equ 0000h
RB7PPS_RB7PPS0_SIZE                      equ 0001h
RB7PPS_RB7PPS0_LENGTH                    equ 0001h
RB7PPS_RB7PPS0_MASK                      equ 0001h
RB7PPS_RB7PPS1_POSN                      equ 0001h
RB7PPS_RB7PPS1_POSITION                  equ 0001h
RB7PPS_RB7PPS1_SIZE                      equ 0001h
RB7PPS_RB7PPS1_LENGTH                    equ 0001h
RB7PPS_RB7PPS1_MASK                      equ 0002h
RB7PPS_RB7PPS2_POSN                      equ 0002h
RB7PPS_RB7PPS2_POSITION                  equ 0002h
RB7PPS_RB7PPS2_SIZE                      equ 0001h
RB7PPS_RB7PPS2_LENGTH                    equ 0001h
RB7PPS_RB7PPS2_MASK                      equ 0004h
RB7PPS_RB7PPS3_POSN                      equ 0003h
RB7PPS_RB7PPS3_POSITION                  equ 0003h
RB7PPS_RB7PPS3_SIZE                      equ 0001h
RB7PPS_RB7PPS3_LENGTH                    equ 0001h
RB7PPS_RB7PPS3_MASK                      equ 0008h
RB7PPS_RB7PPS4_POSN                      equ 0004h
RB7PPS_RB7PPS4_POSITION                  equ 0004h
RB7PPS_RB7PPS4_SIZE                      equ 0001h
RB7PPS_RB7PPS4_LENGTH                    equ 0001h
RB7PPS_RB7PPS4_MASK                      equ 0010h
RB7PPS_RB7PPS5_POSN                      equ 0005h
RB7PPS_RB7PPS5_POSITION                  equ 0005h
RB7PPS_RB7PPS5_SIZE                      equ 0001h
RB7PPS_RB7PPS5_LENGTH                    equ 0001h
RB7PPS_RB7PPS5_MASK                      equ 0020h
RB7PPS_RB7PPS6_POSN                      equ 0006h
RB7PPS_RB7PPS6_POSITION                  equ 0006h
RB7PPS_RB7PPS6_SIZE                      equ 0001h
RB7PPS_RB7PPS6_LENGTH                    equ 0001h
RB7PPS_RB7PPS6_MASK                      equ 0040h

// Register: RC0PPS
#define RC0PPS RC0PPS
RC0PPS                                   equ 0211h
// bitfield definitions
RC0PPS_RC0PPS0_POSN                      equ 0000h
RC0PPS_RC0PPS0_POSITION                  equ 0000h
RC0PPS_RC0PPS0_SIZE                      equ 0001h
RC0PPS_RC0PPS0_LENGTH                    equ 0001h
RC0PPS_RC0PPS0_MASK                      equ 0001h
RC0PPS_RC0PPS1_POSN                      equ 0001h
RC0PPS_RC0PPS1_POSITION                  equ 0001h
RC0PPS_RC0PPS1_SIZE                      equ 0001h
RC0PPS_RC0PPS1_LENGTH                    equ 0001h
RC0PPS_RC0PPS1_MASK                      equ 0002h
RC0PPS_RC0PPS2_POSN                      equ 0002h
RC0PPS_RC0PPS2_POSITION                  equ 0002h
RC0PPS_RC0PPS2_SIZE                      equ 0001h
RC0PPS_RC0PPS2_LENGTH                    equ 0001h
RC0PPS_RC0PPS2_MASK                      equ 0004h
RC0PPS_RC0PPS3_POSN                      equ 0003h
RC0PPS_RC0PPS3_POSITION                  equ 0003h
RC0PPS_RC0PPS3_SIZE                      equ 0001h
RC0PPS_RC0PPS3_LENGTH                    equ 0001h
RC0PPS_RC0PPS3_MASK                      equ 0008h
RC0PPS_RC0PPS4_POSN                      equ 0004h
RC0PPS_RC0PPS4_POSITION                  equ 0004h
RC0PPS_RC0PPS4_SIZE                      equ 0001h
RC0PPS_RC0PPS4_LENGTH                    equ 0001h
RC0PPS_RC0PPS4_MASK                      equ 0010h
RC0PPS_RC0PPS5_POSN                      equ 0005h
RC0PPS_RC0PPS5_POSITION                  equ 0005h
RC0PPS_RC0PPS5_SIZE                      equ 0001h
RC0PPS_RC0PPS5_LENGTH                    equ 0001h
RC0PPS_RC0PPS5_MASK                      equ 0020h
RC0PPS_RC0PPS6_POSN                      equ 0006h
RC0PPS_RC0PPS6_POSITION                  equ 0006h
RC0PPS_RC0PPS6_SIZE                      equ 0001h
RC0PPS_RC0PPS6_LENGTH                    equ 0001h
RC0PPS_RC0PPS6_MASK                      equ 0040h

// Register: RC1PPS
#define RC1PPS RC1PPS
RC1PPS                                   equ 0212h
// bitfield definitions
RC1PPS_RC1PPS0_POSN                      equ 0000h
RC1PPS_RC1PPS0_POSITION                  equ 0000h
RC1PPS_RC1PPS0_SIZE                      equ 0001h
RC1PPS_RC1PPS0_LENGTH                    equ 0001h
RC1PPS_RC1PPS0_MASK                      equ 0001h
RC1PPS_RC1PPS1_POSN                      equ 0001h
RC1PPS_RC1PPS1_POSITION                  equ 0001h
RC1PPS_RC1PPS1_SIZE                      equ 0001h
RC1PPS_RC1PPS1_LENGTH                    equ 0001h
RC1PPS_RC1PPS1_MASK                      equ 0002h
RC1PPS_RC1PPS2_POSN                      equ 0002h
RC1PPS_RC1PPS2_POSITION                  equ 0002h
RC1PPS_RC1PPS2_SIZE                      equ 0001h
RC1PPS_RC1PPS2_LENGTH                    equ 0001h
RC1PPS_RC1PPS2_MASK                      equ 0004h
RC1PPS_RC1PPS3_POSN                      equ 0003h
RC1PPS_RC1PPS3_POSITION                  equ 0003h
RC1PPS_RC1PPS3_SIZE                      equ 0001h
RC1PPS_RC1PPS3_LENGTH                    equ 0001h
RC1PPS_RC1PPS3_MASK                      equ 0008h
RC1PPS_RC1PPS4_POSN                      equ 0004h
RC1PPS_RC1PPS4_POSITION                  equ 0004h
RC1PPS_RC1PPS4_SIZE                      equ 0001h
RC1PPS_RC1PPS4_LENGTH                    equ 0001h
RC1PPS_RC1PPS4_MASK                      equ 0010h
RC1PPS_RC1PPS5_POSN                      equ 0005h
RC1PPS_RC1PPS5_POSITION                  equ 0005h
RC1PPS_RC1PPS5_SIZE                      equ 0001h
RC1PPS_RC1PPS5_LENGTH                    equ 0001h
RC1PPS_RC1PPS5_MASK                      equ 0020h
RC1PPS_RC1PPS6_POSN                      equ 0006h
RC1PPS_RC1PPS6_POSITION                  equ 0006h
RC1PPS_RC1PPS6_SIZE                      equ 0001h
RC1PPS_RC1PPS6_LENGTH                    equ 0001h
RC1PPS_RC1PPS6_MASK                      equ 0040h

// Register: RC2PPS
#define RC2PPS RC2PPS
RC2PPS                                   equ 0213h
// bitfield definitions
RC2PPS_RC2PPS0_POSN                      equ 0000h
RC2PPS_RC2PPS0_POSITION                  equ 0000h
RC2PPS_RC2PPS0_SIZE                      equ 0001h
RC2PPS_RC2PPS0_LENGTH                    equ 0001h
RC2PPS_RC2PPS0_MASK                      equ 0001h
RC2PPS_RC2PPS1_POSN                      equ 0001h
RC2PPS_RC2PPS1_POSITION                  equ 0001h
RC2PPS_RC2PPS1_SIZE                      equ 0001h
RC2PPS_RC2PPS1_LENGTH                    equ 0001h
RC2PPS_RC2PPS1_MASK                      equ 0002h
RC2PPS_RC2PPS2_POSN                      equ 0002h
RC2PPS_RC2PPS2_POSITION                  equ 0002h
RC2PPS_RC2PPS2_SIZE                      equ 0001h
RC2PPS_RC2PPS2_LENGTH                    equ 0001h
RC2PPS_RC2PPS2_MASK                      equ 0004h
RC2PPS_RC2PPS3_POSN                      equ 0003h
RC2PPS_RC2PPS3_POSITION                  equ 0003h
RC2PPS_RC2PPS3_SIZE                      equ 0001h
RC2PPS_RC2PPS3_LENGTH                    equ 0001h
RC2PPS_RC2PPS3_MASK                      equ 0008h
RC2PPS_RC2PPS4_POSN                      equ 0004h
RC2PPS_RC2PPS4_POSITION                  equ 0004h
RC2PPS_RC2PPS4_SIZE                      equ 0001h
RC2PPS_RC2PPS4_LENGTH                    equ 0001h
RC2PPS_RC2PPS4_MASK                      equ 0010h
RC2PPS_RC2PPS5_POSN                      equ 0005h
RC2PPS_RC2PPS5_POSITION                  equ 0005h
RC2PPS_RC2PPS5_SIZE                      equ 0001h
RC2PPS_RC2PPS5_LENGTH                    equ 0001h
RC2PPS_RC2PPS5_MASK                      equ 0020h
RC2PPS_RC2PPS6_POSN                      equ 0006h
RC2PPS_RC2PPS6_POSITION                  equ 0006h
RC2PPS_RC2PPS6_SIZE                      equ 0001h
RC2PPS_RC2PPS6_LENGTH                    equ 0001h
RC2PPS_RC2PPS6_MASK                      equ 0040h

