GopalSaraf/Practicals/PSDL/include/proc/pic18f25q43.inc
#define NACK1IE                          BANKMASK(I2C1ERR), 0, b
#define NACK1IF                          BANKMASK(I2C1ERR), 4, b
#define NACKIE                           BANKMASK(I2C1ERR), 0, b
#define NACKIF                           BANKMASK(I2C1ERR), 4, b
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0, b
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1, b
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2, b
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3, b
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4, b
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5, b
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6, b
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7, b
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0, b
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1, b
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2, b
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3, b
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2, b
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3, b
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4, b
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5, b
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6, b
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7, b
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0, b
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1, b
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0, b
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1, b
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2, b
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3, b
#define NCO1CKS4                         BANKMASK(NCO1CLK), 4, b
#define NCO1EN                           BANKMASK(NCO1CON), 7, b
#define NCO1IE                           BANKMASK(PIE6), 3, a
#define NCO1IF                           BANKMASK(PIR6), 3, a
#define NCO1INC0                         BANKMASK(NCO1INCL), 0, b
#define NCO1INC1                         BANKMASK(NCO1INCL), 1, b
#define NCO1INC10                        BANKMASK(NCO1INCH), 2, b
#define NCO1INC11                        BANKMASK(NCO1INCH), 3, b
#define NCO1INC12                        BANKMASK(NCO1INCH), 4, b
#define NCO1INC13                        BANKMASK(NCO1INCH), 5, b
#define NCO1INC14                        BANKMASK(NCO1INCH), 6, b
#define NCO1INC15                        BANKMASK(NCO1INCH), 7, b
#define NCO1INC16                        BANKMASK(NCO1INCU), 0, b
#define NCO1INC17                        BANKMASK(NCO1INCU), 1, b
#define NCO1INC18                        BANKMASK(NCO1INCU), 2, b
#define NCO1INC19                        BANKMASK(NCO1INCU), 3, b
#define NCO1INC2                         BANKMASK(NCO1INCL), 2, b
#define NCO1INC3                         BANKMASK(NCO1INCL), 3, b
#define NCO1INC4                         BANKMASK(NCO1INCL), 4, b
#define NCO1INC5                         BANKMASK(NCO1INCL), 5, b
#define NCO1INC6                         BANKMASK(NCO1INCL), 6, b
#define NCO1INC7                         BANKMASK(NCO1INCL), 7, b
#define NCO1INC8                         BANKMASK(NCO1INCH), 0, b
#define NCO1INC9                         BANKMASK(NCO1INCH), 1, b
#define NCO1IP                           BANKMASK(IPR6), 3, b
#define NCO1MD                           BANKMASK(PMD4), 0, b
#define NCO1OUT                          BANKMASK(NCO1CON), 5, b
#define NCO1PFM                          BANKMASK(NCO1CON), 0, b
#define NCO1POL                          BANKMASK(NCO1CON), 4, b
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5, b
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6, b
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7, b
#define NCO2ACC0                         BANKMASK(NCO2ACCL), 0, b
#define NCO2ACC1                         BANKMASK(NCO2ACCL), 1, b
#define NCO2ACC10                        BANKMASK(NCO2ACCH), 2, b
#define NCO2ACC11                        BANKMASK(NCO2ACCH), 3, b
#define NCO2ACC12                        BANKMASK(NCO2ACCH), 4, b
#define NCO2ACC13                        BANKMASK(NCO2ACCH), 5, b
#define NCO2ACC14                        BANKMASK(NCO2ACCH), 6, b
#define NCO2ACC15                        BANKMASK(NCO2ACCH), 7, b
#define NCO2ACC16                        BANKMASK(NCO2ACCU), 0, b
#define NCO2ACC17                        BANKMASK(NCO2ACCU), 1, b
#define NCO2ACC18                        BANKMASK(NCO2ACCU), 2, b
#define NCO2ACC19                        BANKMASK(NCO2ACCU), 3, b
#define NCO2ACC2                         BANKMASK(NCO2ACCL), 2, b
#define NCO2ACC3                         BANKMASK(NCO2ACCL), 3, b
#define NCO2ACC4                         BANKMASK(NCO2ACCL), 4, b
#define NCO2ACC5                         BANKMASK(NCO2ACCL), 5, b
#define NCO2ACC6                         BANKMASK(NCO2ACCL), 6, b
#define NCO2ACC7                         BANKMASK(NCO2ACCL), 7, b
#define NCO2ACC8                         BANKMASK(NCO2ACCH), 0, b
#define NCO2ACC9                         BANKMASK(NCO2ACCH), 1, b
#define NCO2CKS0                         BANKMASK(NCO2CLK), 0, b
#define NCO2CKS1                         BANKMASK(NCO2CLK), 1, b
#define NCO2CKS2                         BANKMASK(NCO2CLK), 2, b
#define NCO2CKS3                         BANKMASK(NCO2CLK), 3, b
#define NCO2CKS4                         BANKMASK(NCO2CLK), 4, b
#define NCO2EN                           BANKMASK(NCO2CON), 7, b
#define NCO2IE                           BANKMASK(PIE10), 3, a
#define NCO2IF                           BANKMASK(PIR10), 3, a
#define NCO2INC0                         BANKMASK(NCO2INCL), 0, b
#define NCO2INC1                         BANKMASK(NCO2INCL), 1, b
#define NCO2INC10                        BANKMASK(NCO2INCH), 2, b
#define NCO2INC11                        BANKMASK(NCO2INCH), 3, b
#define NCO2INC12                        BANKMASK(NCO2INCH), 4, b
#define NCO2INC13                        BANKMASK(NCO2INCH), 5, b
#define NCO2INC14                        BANKMASK(NCO2INCH), 6, b
#define NCO2INC15                        BANKMASK(NCO2INCH), 7, b
#define NCO2INC16                        BANKMASK(NCO2INCU), 0, b
#define NCO2INC17                        BANKMASK(NCO2INCU), 1, b
#define NCO2INC18                        BANKMASK(NCO2INCU), 2, b
#define NCO2INC19                        BANKMASK(NCO2INCU), 3, b
#define NCO2INC2                         BANKMASK(NCO2INCL), 2, b
#define NCO2INC3                         BANKMASK(NCO2INCL), 3, b
#define NCO2INC4                         BANKMASK(NCO2INCL), 4, b
#define NCO2INC5                         BANKMASK(NCO2INCL), 5, b
#define NCO2INC6                         BANKMASK(NCO2INCL), 6, b
#define NCO2INC7                         BANKMASK(NCO2INCL), 7, b
#define NCO2INC8                         BANKMASK(NCO2INCH), 0, b
#define NCO2INC9                         BANKMASK(NCO2INCH), 1, b
#define NCO2IP                           BANKMASK(IPR10), 3, b
#define NCO2MD                           BANKMASK(PMD4), 1, b
#define NCO2OUT                          BANKMASK(NCO2CON), 5, b
#define NCO2PFM                          BANKMASK(NCO2CON), 0, b
#define NCO2POL                          BANKMASK(NCO2CON), 4, b
#define NCO2PWS0                         BANKMASK(NCO2CLK), 5, b
#define NCO2PWS1                         BANKMASK(NCO2CLK), 6, b
#define NCO2PWS2                         BANKMASK(NCO2CLK), 7, b
#define NCO3ACC0                         BANKMASK(NCO3ACCL), 0, b
#define NCO3ACC1                         BANKMASK(NCO3ACCL), 1, b
#define NCO3ACC10                        BANKMASK(NCO3ACCH), 2, b
#define NCO3ACC11                        BANKMASK(NCO3ACCH), 3, b
#define NCO3ACC12                        BANKMASK(NCO3ACCH), 4, b
#define NCO3ACC13                        BANKMASK(NCO3ACCH), 5, b
#define NCO3ACC14                        BANKMASK(NCO3ACCH), 6, b
#define NCO3ACC15                        BANKMASK(NCO3ACCH), 7, b
#define NCO3ACC16                        BANKMASK(NCO3ACCU), 0, b
#define NCO3ACC17                        BANKMASK(NCO3ACCU), 1, b
#define NCO3ACC18                        BANKMASK(NCO3ACCU), 2, b
#define NCO3ACC19                        BANKMASK(NCO3ACCU), 3, b
#define NCO3ACC2                         BANKMASK(NCO3ACCL), 2, b
#define NCO3ACC3                         BANKMASK(NCO3ACCL), 3, b
#define NCO3ACC4                         BANKMASK(NCO3ACCL), 4, b
#define NCO3ACC5                         BANKMASK(NCO3ACCL), 5, b
#define NCO3ACC6                         BANKMASK(NCO3ACCL), 6, b
#define NCO3ACC7                         BANKMASK(NCO3ACCL), 7, b
#define NCO3ACC8                         BANKMASK(NCO3ACCH), 0, b
#define NCO3ACC9                         BANKMASK(NCO3ACCH), 1, b
#define NCO3CKS0                         BANKMASK(NCO3CLK), 0, b
#define NCO3CKS1                         BANKMASK(NCO3CLK), 1, b
#define NCO3CKS2                         BANKMASK(NCO3CLK), 2, b
#define NCO3CKS3                         BANKMASK(NCO3CLK), 3, b
#define NCO3CKS4                         BANKMASK(NCO3CLK), 4, b
#define NCO3EN                           BANKMASK(NCO3CON), 7, b
#define NCO3IE                           BANKMASK(PIE14), 3, a
#define NCO3IF                           BANKMASK(PIR14), 3, a
#define NCO3INC0                         BANKMASK(NCO3INCL), 0, b
#define NCO3INC1                         BANKMASK(NCO3INCL), 1, b
#define NCO3INC10                        BANKMASK(NCO3INCH), 2, b
#define NCO3INC11                        BANKMASK(NCO3INCH), 3, b
#define NCO3INC12                        BANKMASK(NCO3INCH), 4, b
#define NCO3INC13                        BANKMASK(NCO3INCH), 5, b
#define NCO3INC14                        BANKMASK(NCO3INCH), 6, b
#define NCO3INC15                        BANKMASK(NCO3INCH), 7, b
#define NCO3INC16                        BANKMASK(NCO3INCU), 0, b
#define NCO3INC17                        BANKMASK(NCO3INCU), 1, b
#define NCO3INC18                        BANKMASK(NCO3INCU), 2, b
#define NCO3INC19                        BANKMASK(NCO3INCU), 3, b
#define NCO3INC2                         BANKMASK(NCO3INCL), 2, b
#define NCO3INC3                         BANKMASK(NCO3INCL), 3, b
#define NCO3INC4                         BANKMASK(NCO3INCL), 4, b
#define NCO3INC5                         BANKMASK(NCO3INCL), 5, b
#define NCO3INC6                         BANKMASK(NCO3INCL), 6, b
#define NCO3INC7                         BANKMASK(NCO3INCL), 7, b
#define NCO3INC8                         BANKMASK(NCO3INCH), 0, b
#define NCO3INC9                         BANKMASK(NCO3INCH), 1, b
#define NCO3IP                           BANKMASK(IPR14), 3, b
#define NCO3MD                           BANKMASK(PMD4), 2, b
#define NCO3OUT                          BANKMASK(NCO3CON), 5, b
#define NCO3PFM                          BANKMASK(NCO3CON), 0, b
#define NCO3POL                          BANKMASK(NCO3CON), 4, b
#define NCO3PWS0                         BANKMASK(NCO3CLK), 5, b
#define NCO3PWS1                         BANKMASK(NCO3CLK), 6, b
#define NCO3PWS2                         BANKMASK(NCO3CLK), 7, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_A                            BANKMASK(I2C1STAT0), 3, b
#define NOT_ADDRESS                      BANKMASK(I2C1STAT0), 3, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_MEMV                         BANKMASK(PCON1), 1, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RCM                          BANKMASK(PCON1), 0, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RVREG                        BANKMASK(PCON1), 2, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, b
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, b
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, b
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, b
#define NOT_T5DONE                       BANKMASK(T5GCON), 3, b
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, b
#define NOT_W                            BANKMASK(I2C1STAT0), 4, b
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NOT_WRITE                        BANKMASK(I2C1STAT0), 4, b
#define NREF0                            BANKMASK(ADREF), 4, b
#define NSS0                             BANKMASK(DAC1CON), 0, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, b
#define NVMADR1                          BANKMASK(NVMADRL), 1, b
#define NVMADR10                         BANKMASK(NVMADRH), 2, b
#define NVMADR11                         BANKMASK(NVMADRH), 3, b
#define NVMADR12                         BANKMASK(NVMADRH), 4, b
#define NVMADR13                         BANKMASK(NVMADRH), 5, b
#define NVMADR14                         BANKMASK(NVMADRH), 6, b
#define NVMADR15                         BANKMASK(NVMADRH), 7, b
#define NVMADR16                         BANKMASK(NVMADRU), 0, b
#define NVMADR17                         BANKMASK(NVMADRU), 1, b
#define NVMADR18                         BANKMASK(NVMADRU), 2, b
#define NVMADR19                         BANKMASK(NVMADRU), 3, b
#define NVMADR2                          BANKMASK(NVMADRL), 2, b
#define NVMADR20                         BANKMASK(NVMADRU), 4, b
#define NVMADR21                         BANKMASK(NVMADRU), 5, b
#define NVMADR3                          BANKMASK(NVMADRL), 3, b
#define NVMADR4                          BANKMASK(NVMADRL), 4, b
#define NVMADR5                          BANKMASK(NVMADRL), 5, b
#define NVMADR6                          BANKMASK(NVMADRL), 6, b
#define NVMADR7                          BANKMASK(NVMADRL), 7, b
#define NVMADR8                          BANKMASK(NVMADRH), 0, b
#define NVMADR9                          BANKMASK(NVMADRH), 1, b
#define NVMDAT0                          BANKMASK(NVMDATL), 0, b
#define NVMDAT1                          BANKMASK(NVMDATL), 1, b
#define NVMDAT10                         BANKMASK(NVMDATH), 2, b
#define NVMDAT11                         BANKMASK(NVMDATH), 3, b
#define NVMDAT12                         BANKMASK(NVMDATH), 4, b
#define NVMDAT13                         BANKMASK(NVMDATH), 5, b
#define NVMDAT14                         BANKMASK(NVMDATH), 6, b
#define NVMDAT15                         BANKMASK(NVMDATH), 7, b
#define NVMDAT2                          BANKMASK(NVMDATL), 2, b
#define NVMDAT3                          BANKMASK(NVMDATL), 3, b
#define NVMDAT4                          BANKMASK(NVMDATL), 4, b
#define NVMDAT5                          BANKMASK(NVMDATL), 5, b
#define NVMDAT6                          BANKMASK(NVMDATL), 6, b
#define NVMDAT7                          BANKMASK(NVMDATL), 7, b
#define NVMDAT8                          BANKMASK(NVMDATH), 0, b
#define NVMDAT9                          BANKMASK(NVMDATH), 1, b
#define NVMGO                            BANKMASK(NVMCON0), 0, b
#define NVMIE                            BANKMASK(PIE15), 0, a
#define NVMIF                            BANKMASK(PIR15), 0, a
#define NVMIP                            BANKMASK(IPR15), 0, b
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define OE                               BANKMASK(CLCnCON), 6, b
#define OE0                              BANKMASK(DAC1CON), 4, b
#define OE1                              BANKMASK(DAC1CON), 5, b
#define OPOL                             BANKMASK(MD1CON0), 4, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define ORS                              BANKMASK(ACTCON), 1, b
#define OSFIE                            BANKMASK(PIE0), 2, a
#define OSFIF                            BANKMASK(PIR0), 2, a
#define OSFIP                            BANKMASK(IPR0), 2, b
#define P1H                              BANKMASK(U1P1H), 0, b
#define P2H                              BANKMASK(U1P2H), 0, b
#define P3H                              BANKMASK(U1P3H), 0, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PCIE                             BANKMASK(I2C1PIE), 2, b
#define PCIF                             BANKMASK(I2C1PIR), 2, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLLEN                            BANKMASK(OSCEN), 0, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define PMSYS0                           BANKMASK(VREGCON), 4, b
#define PMSYS1                           BANKMASK(VREGCON), 5, b
#define POR                              BANKMASK(PCON0), 1, a
#define PORT                             BANKMASK(INT0PPS), 3, b
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PRE0                             BANKMASK(ADPREL), 0, b
#define PRE1                             BANKMASK(ADPREL), 1, b
#define PRE10                            BANKMASK(ADPREH), 2, b
#define PRE11                            BANKMASK(ADPREH), 3, b
#define PRE12                            BANKMASK(ADPREH), 4, b
#define PRE2                             BANKMASK(ADPREL), 2, b
#define PRE3                             BANKMASK(ADPREL), 3, b
#define PRE4                             BANKMASK(ADPREL), 4, b
#define PRE5                             BANKMASK(ADPREL), 5, b
#define PRE6                             BANKMASK(ADPREL), 6, b
#define PRE7                             BANKMASK(ADPREL), 7, b
#define PRE8                             BANKMASK(ADPREH), 0, b
#define PRE9                             BANKMASK(ADPREH), 1, b
#define PREF0                            BANKMASK(ADREF), 0, b
#define PREF1                            BANKMASK(ADREF), 1, b
#define PREV0                            BANKMASK(ADPREVL), 0, b
#define PREV1                            BANKMASK(ADPREVL), 1, b
#define PREV10                           BANKMASK(ADPREVH), 2, b
#define PREV11                           BANKMASK(ADPREVH), 3, b
#define PREV12                           BANKMASK(ADPREVH), 4, b
#define PREV13                           BANKMASK(ADPREVH), 5, b
#define PREV14                           BANKMASK(ADPREVH), 6, b
#define PREV15                           BANKMASK(ADPREVH), 7, b
#define PREV2                            BANKMASK(ADPREVL), 2, b
#define PREV3                            BANKMASK(ADPREVL), 3, b
#define PREV4                            BANKMASK(ADPREVL), 4, b
#define PREV5                            BANKMASK(ADPREVL), 5, b
#define PREV6                            BANKMASK(ADPREVL), 6, b
#define PREV7                            BANKMASK(ADPREVL), 7, b
#define PREV8                            BANKMASK(ADPREVH), 0, b
#define PREV9                            BANKMASK(ADPREVH), 1, b
#define PRLOCKED                         BANKMASK(PRLOCK), 0, b
#define PS0                              BANKMASK(WDTCON0), 1, b
#define PS1                              BANKMASK(WDTCON0), 2, b
#define PS2                              BANKMASK(WDTCON0), 3, b
#define PS3                              BANKMASK(WDTCON0), 4, b
#define PS4                              BANKMASK(WDTCON0), 5, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PSS0                             BANKMASK(DAC1CON), 2, b
#define PSS1                             BANKMASK(DAC1CON), 3, b
#define PWM1ERSPPS0                      BANKMASK(PWM1ERSPPS), 0, b
#define PWM1ERSPPS1                      BANKMASK(PWM1ERSPPS), 1, b
#define PWM1ERSPPS2                      BANKMASK(PWM1ERSPPS), 2, b
#define PWM1ERSPPS3                      BANKMASK(PWM1ERSPPS), 3, b
#define PWM1ERSPPS4                      BANKMASK(PWM1ERSPPS), 4, b
#define PWM1IE                           BANKMASK(PIE4), 7, a
#define PWM1IF                           BANKMASK(PIR4), 7, a
#define PWM1IP                           BANKMASK(IPR4), 7, b
#define PWM1MD                           BANKMASK(PMD5), 4, b
#define PWM1PIE                          BANKMASK(PIE4), 6, a
#define PWM1PIF                          BANKMASK(PIR4), 6, a
#define PWM1PIP                          BANKMASK(IPR4), 6, b
#define PWM2ERSPPS0                      BANKMASK(PWM2ERSPPS), 0, b
#define PWM2ERSPPS1                      BANKMASK(PWM2ERSPPS), 1, b
#define PWM2ERSPPS2                      BANKMASK(PWM2ERSPPS), 2, b
#define PWM2ERSPPS3                      BANKMASK(PWM2ERSPPS), 3, b
