GopalSaraf/Practicals/PSDL/include/proc/pic18f25q43.inc
#define PWM2ERSPPS4                      BANKMASK(PWM2ERSPPS), 4, b
#define PWM2ERSPPS5                      BANKMASK(PWM2ERSPPS), 5, b
#define PWM2IE                           BANKMASK(PIE5), 7, a
#define PWM2IF                           BANKMASK(PIR5), 7, a
#define PWM2IP                           BANKMASK(IPR5), 7, b
#define PWM2MD                           BANKMASK(PMD5), 5, b
#define PWM2PIE                          BANKMASK(PIE5), 6, a
#define PWM2PIF                          BANKMASK(PIR5), 6, a
#define PWM2PIP                          BANKMASK(IPR5), 6, b
#define PWM3ERSPPS0                      BANKMASK(PWM3ERSPPS), 0, b
#define PWM3ERSPPS1                      BANKMASK(PWM3ERSPPS), 1, b
#define PWM3ERSPPS2                      BANKMASK(PWM3ERSPPS), 2, b
#define PWM3ERSPPS3                      BANKMASK(PWM3ERSPPS), 3, b
#define PWM3ERSPPS4                      BANKMASK(PWM3ERSPPS), 4, b
#define PWM3IE                           BANKMASK(PIE7), 7, a
#define PWM3IF                           BANKMASK(PIR7), 7, a
#define PWM3IP                           BANKMASK(IPR7), 7, b
#define PWM3MD                           BANKMASK(PMD5), 6, b
#define PWM3PIE                          BANKMASK(PIE7), 6, a
#define PWM3PIF                          BANKMASK(PIR7), 6, a
#define PWM3PIP                          BANKMASK(IPR7), 6, b
#define PWMIN0PPS0                       BANKMASK(PWMIN0PPS), 0, b
#define PWMIN0PPS1                       BANKMASK(PWMIN0PPS), 1, b
#define PWMIN0PPS2                       BANKMASK(PWMIN0PPS), 2, b
#define PWMIN0PPS3                       BANKMASK(PWMIN0PPS), 3, b
#define PWMIN0PPS4                       BANKMASK(PWMIN0PPS), 4, b
#define PWMIN0PPS5                       BANKMASK(PWMIN0PPS), 5, b
#define PWMIN1PPS0                       BANKMASK(PWMIN1PPS), 0, b
#define PWMIN1PPS1                       BANKMASK(PWMIN1PPS), 1, b
#define PWMIN1PPS2                       BANKMASK(PWMIN1PPS), 2, b
#define PWMIN1PPS3                       BANKMASK(PWMIN1PPS), 3, b
#define PWMIN1PPS4                       BANKMASK(PWMIN1PPS), 4, b
#define PWMIN1PPS5                       BANKMASK(PWMIN1PPS), 5, b
#define RA0                              BANKMASK(PORTA), 0, a
#define RA0PPS0                          BANKMASK(RA0PPS), 0, b
#define RA0PPS1                          BANKMASK(RA0PPS), 1, b
#define RA0PPS2                          BANKMASK(RA0PPS), 2, b
#define RA0PPS3                          BANKMASK(RA0PPS), 3, b
#define RA0PPS4                          BANKMASK(RA0PPS), 4, b
#define RA0PPS5                          BANKMASK(RA0PPS), 5, b
#define RA0PPS6                          BANKMASK(RA0PPS), 6, b
#define RA1                              BANKMASK(PORTA), 1, a
#define RA1PPS0                          BANKMASK(RA1PPS), 0, b
#define RA1PPS1                          BANKMASK(RA1PPS), 1, b
#define RA1PPS2                          BANKMASK(RA1PPS), 2, b
#define RA1PPS3                          BANKMASK(RA1PPS), 3, b
#define RA1PPS4                          BANKMASK(RA1PPS), 4, b
#define RA1PPS5                          BANKMASK(RA1PPS), 5, b
#define RA1PPS6                          BANKMASK(RA1PPS), 6, b
#define RA2                              BANKMASK(PORTA), 2, a
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA2PPS5                          BANKMASK(RA2PPS), 5, b
#define RA2PPS6                          BANKMASK(RA2PPS), 6, b
#define RA3                              BANKMASK(PORTA), 3, a
#define RA3PPS0                          BANKMASK(RA3PPS), 0, b
#define RA3PPS1                          BANKMASK(RA3PPS), 1, b
#define RA3PPS2                          BANKMASK(RA3PPS), 2, b
#define RA3PPS3                          BANKMASK(RA3PPS), 3, b
#define RA3PPS4                          BANKMASK(RA3PPS), 4, b
#define RA3PPS5                          BANKMASK(RA3PPS), 5, b
#define RA3PPS6                          BANKMASK(RA3PPS), 6, b
#define RA4                              BANKMASK(PORTA), 4, a
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA4PPS5                          BANKMASK(RA4PPS), 5, b
#define RA4PPS6                          BANKMASK(RA4PPS), 6, b
#define RA5                              BANKMASK(PORTA), 5, a
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA5PPS5                          BANKMASK(RA5PPS), 5, b
#define RA5PPS6                          BANKMASK(RA5PPS), 6, b
#define RA6                              BANKMASK(PORTA), 6, a
#define RA6PPS0                          BANKMASK(RA6PPS), 0, b
#define RA6PPS1                          BANKMASK(RA6PPS), 1, b
#define RA6PPS2                          BANKMASK(RA6PPS), 2, b
#define RA6PPS3                          BANKMASK(RA6PPS), 3, b
#define RA6PPS4                          BANKMASK(RA6PPS), 4, b
#define RA6PPS5                          BANKMASK(RA6PPS), 5, b
#define RA6PPS6                          BANKMASK(RA6PPS), 6, b
#define RA7                              BANKMASK(PORTA), 7, a
#define RA7PPS0                          BANKMASK(RA7PPS), 0, b
#define RA7PPS1                          BANKMASK(RA7PPS), 1, b
#define RA7PPS2                          BANKMASK(RA7PPS), 2, b
#define RA7PPS3                          BANKMASK(RA7PPS), 3, b
#define RA7PPS4                          BANKMASK(RA7PPS), 4, b
#define RA7PPS5                          BANKMASK(RA7PPS), 5, b
#define RA7PPS6                          BANKMASK(RA7PPS), 6, b
#define RB0                              BANKMASK(PORTB), 0, a
#define RB0PPS0                          BANKMASK(RB0PPS), 0, b
#define RB0PPS1                          BANKMASK(RB0PPS), 1, b
#define RB0PPS2                          BANKMASK(RB0PPS), 2, b
#define RB0PPS3                          BANKMASK(RB0PPS), 3, b
#define RB0PPS4                          BANKMASK(RB0PPS), 4, b
#define RB0PPS5                          BANKMASK(RB0PPS), 5, b
#define RB0PPS6                          BANKMASK(RB0PPS), 6, b
#define RB1                              BANKMASK(PORTB), 1, a
#define RB1PPS0                          BANKMASK(RB1PPS), 0, b
#define RB1PPS1                          BANKMASK(RB1PPS), 1, b
#define RB1PPS2                          BANKMASK(RB1PPS), 2, b
#define RB1PPS3                          BANKMASK(RB1PPS), 3, b
#define RB1PPS4                          BANKMASK(RB1PPS), 4, b
#define RB1PPS5                          BANKMASK(RB1PPS), 5, b
#define RB1PPS6                          BANKMASK(RB1PPS), 6, b
#define RB2                              BANKMASK(PORTB), 2, a
#define RB2PPS0                          BANKMASK(RB2PPS), 0, b
#define RB2PPS1                          BANKMASK(RB2PPS), 1, b
#define RB2PPS2                          BANKMASK(RB2PPS), 2, b
#define RB2PPS3                          BANKMASK(RB2PPS), 3, b
#define RB2PPS4                          BANKMASK(RB2PPS), 4, b
#define RB2PPS5                          BANKMASK(RB2PPS), 5, b
#define RB2PPS6                          BANKMASK(RB2PPS), 6, b
#define RB3                              BANKMASK(PORTB), 3, a
#define RB3PPS0                          BANKMASK(RB3PPS), 0, b
#define RB3PPS1                          BANKMASK(RB3PPS), 1, b
#define RB3PPS2                          BANKMASK(RB3PPS), 2, b
#define RB3PPS3                          BANKMASK(RB3PPS), 3, b
#define RB3PPS4                          BANKMASK(RB3PPS), 4, b
#define RB3PPS5                          BANKMASK(RB3PPS), 5, b
#define RB3PPS6                          BANKMASK(RB3PPS), 6, b
#define RB4                              BANKMASK(PORTB), 4, a
#define RB4PPS0                          BANKMASK(RB4PPS), 0, b
#define RB4PPS1                          BANKMASK(RB4PPS), 1, b
#define RB4PPS2                          BANKMASK(RB4PPS), 2, b
#define RB4PPS3                          BANKMASK(RB4PPS), 3, b
#define RB4PPS4                          BANKMASK(RB4PPS), 4, b
#define RB4PPS5                          BANKMASK(RB4PPS), 5, b
#define RB4PPS6                          BANKMASK(RB4PPS), 6, b
#define RB5                              BANKMASK(PORTB), 5, a
#define RB5PPS0                          BANKMASK(RB5PPS), 0, b
#define RB5PPS1                          BANKMASK(RB5PPS), 1, b
#define RB5PPS2                          BANKMASK(RB5PPS), 2, b
#define RB5PPS3                          BANKMASK(RB5PPS), 3, b
#define RB5PPS4                          BANKMASK(RB5PPS), 4, b
#define RB5PPS5                          BANKMASK(RB5PPS), 5, b
#define RB5PPS6                          BANKMASK(RB5PPS), 6, b
#define RB6                              BANKMASK(PORTB), 6, a
#define RB6PPS0                          BANKMASK(RB6PPS), 0, b
#define RB6PPS1                          BANKMASK(RB6PPS), 1, b
#define RB6PPS2                          BANKMASK(RB6PPS), 2, b
#define RB6PPS3                          BANKMASK(RB6PPS), 3, b
#define RB6PPS4                          BANKMASK(RB6PPS), 4, b
#define RB6PPS5                          BANKMASK(RB6PPS), 5, b
#define RB6PPS6                          BANKMASK(RB6PPS), 6, b
#define RB7                              BANKMASK(PORTB), 7, a
#define RB7PPS0                          BANKMASK(RB7PPS), 0, b
#define RB7PPS1                          BANKMASK(RB7PPS), 1, b
#define RB7PPS2                          BANKMASK(RB7PPS), 2, b
#define RB7PPS3                          BANKMASK(RB7PPS), 3, b
#define RB7PPS4                          BANKMASK(RB7PPS), 4, b
#define RB7PPS5                          BANKMASK(RB7PPS), 5, b
#define RB7PPS6                          BANKMASK(RB7PPS), 6, b
#define RC0                              BANKMASK(PORTC), 0, a
#define RC0PPS0                          BANKMASK(RC0PPS), 0, b
#define RC0PPS1                          BANKMASK(RC0PPS), 1, b
#define RC0PPS2                          BANKMASK(RC0PPS), 2, b
#define RC0PPS3                          BANKMASK(RC0PPS), 3, b
#define RC0PPS4                          BANKMASK(RC0PPS), 4, b
#define RC0PPS5                          BANKMASK(RC0PPS), 5, b
#define RC0PPS6                          BANKMASK(RC0PPS), 6, b
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1PPS0                          BANKMASK(RC1PPS), 0, b
#define RC1PPS1                          BANKMASK(RC1PPS), 1, b
#define RC1PPS2                          BANKMASK(RC1PPS), 2, b
#define RC1PPS3                          BANKMASK(RC1PPS), 3, b
#define RC1PPS4                          BANKMASK(RC1PPS), 4, b
#define RC1PPS5                          BANKMASK(RC1PPS), 5, b
#define RC1PPS6                          BANKMASK(RC1PPS), 6, b
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2PPS0                          BANKMASK(RC2PPS), 0, b
#define RC2PPS1                          BANKMASK(RC2PPS), 1, b
#define RC2PPS2                          BANKMASK(RC2PPS), 2, b
#define RC2PPS3                          BANKMASK(RC2PPS), 3, b
#define RC2PPS4                          BANKMASK(RC2PPS), 4, b
#define RC2PPS5                          BANKMASK(RC2PPS), 5, b
#define RC2PPS6                          BANKMASK(RC2PPS), 6, b
#define RC3                              BANKMASK(PORTC), 3, a
#define RC3PPS0                          BANKMASK(RC3PPS), 0, b
#define RC3PPS1                          BANKMASK(RC3PPS), 1, b
#define RC3PPS2                          BANKMASK(RC3PPS), 2, b
#define RC3PPS3                          BANKMASK(RC3PPS), 3, b
#define RC3PPS4                          BANKMASK(RC3PPS), 4, b
#define RC3PPS5                          BANKMASK(RC3PPS), 5, b
#define RC3PPS6                          BANKMASK(RC3PPS), 6, b
#define RC4                              BANKMASK(PORTC), 4, a
#define RC4PPS0                          BANKMASK(RC4PPS), 0, b
#define RC4PPS1                          BANKMASK(RC4PPS), 1, b
#define RC4PPS2                          BANKMASK(RC4PPS), 2, b
#define RC4PPS3                          BANKMASK(RC4PPS), 3, b
#define RC4PPS4                          BANKMASK(RC4PPS), 4, b
#define RC4PPS5                          BANKMASK(RC4PPS), 5, b
#define RC4PPS6                          BANKMASK(RC4PPS), 6, b
#define RC5                              BANKMASK(PORTC), 5, a
#define RC5PPS0                          BANKMASK(RC5PPS), 0, b
#define RC5PPS1                          BANKMASK(RC5PPS), 1, b
#define RC5PPS2                          BANKMASK(RC5PPS), 2, b
#define RC5PPS3                          BANKMASK(RC5PPS), 3, b
#define RC5PPS4                          BANKMASK(RC5PPS), 4, b
#define RC5PPS5                          BANKMASK(RC5PPS), 5, b
#define RC5PPS6                          BANKMASK(RC5PPS), 6, b
#define RC6                              BANKMASK(PORTC), 6, a
#define RC6PPS0                          BANKMASK(RC6PPS), 0, b
#define RC6PPS1                          BANKMASK(RC6PPS), 1, b
#define RC6PPS2                          BANKMASK(RC6PPS), 2, b
#define RC6PPS3                          BANKMASK(RC6PPS), 3, b
#define RC6PPS4                          BANKMASK(RC6PPS), 4, b
#define RC6PPS5                          BANKMASK(RC6PPS), 5, b
#define RC6PPS6                          BANKMASK(RC6PPS), 6, b
#define RC7                              BANKMASK(PORTC), 7, a
#define RC7PPS0                          BANKMASK(RC7PPS), 0, b
#define RC7PPS1                          BANKMASK(RC7PPS), 1, b
#define RC7PPS2                          BANKMASK(RC7PPS), 2, b
#define RC7PPS3                          BANKMASK(RC7PPS), 3, b
#define RC7PPS4                          BANKMASK(RC7PPS), 4, b
#define RC7PPS5                          BANKMASK(RC7PPS), 5, b
#define RC7PPS6                          BANKMASK(RC7PPS), 6, b
#define RD0                              BANKMASK(PORTD), 0, a
#define RD1                              BANKMASK(PORTD), 1, a
#define RD161                            BANKMASK(T1CON), 1, b
#define RD163                            BANKMASK(T3CON), 1, b
#define RD165                            BANKMASK(T5CON), 1, b
#define RD2                              BANKMASK(PORTD), 2, a
#define RD3                              BANKMASK(PORTD), 3, a
#define RD4                              BANKMASK(PORTD), 4, a
#define RD5                              BANKMASK(PORTD), 5, a
#define RD6                              BANKMASK(PORTD), 6, a
#define RD7                              BANKMASK(PORTD), 7, a
#define RE3                              BANKMASK(PORTE), 3, a
#define READ                             BANKMASK(I2C1STAT0), 4, b
#define REPEAT                           BANKMASK(SMT1CON1), 6, b
#define RES0                             BANKMASK(ADRESL), 0, b
#define RES1                             BANKMASK(ADRESL), 1, b
#define RES10                            BANKMASK(ADRESH), 2, b
#define RES11                            BANKMASK(ADRESH), 3, b
#define RES12                            BANKMASK(ADRESH), 4, b
#define RES13                            BANKMASK(ADRESH), 5, b
#define RES14                            BANKMASK(ADRESH), 6, b
#define RES15                            BANKMASK(ADRESH), 7, b
#define RES2                             BANKMASK(ADRESL), 2, b
#define RES3                             BANKMASK(ADRESL), 3, b
#define RES4                             BANKMASK(ADRESL), 4, b
#define RES5                             BANKMASK(ADRESL), 5, b
#define RES6                             BANKMASK(ADRESL), 6, b
#define RES7                             BANKMASK(ADRESL), 7, b
#define RES8                             BANKMASK(ADRESH), 0, b
#define RES9                             BANKMASK(ADRESH), 1, b
#define RI                               BANKMASK(PCON0), 2, a
#define RMCLR                            BANKMASK(PCON0), 3, a
#define ROI                              BANKMASK(CPUDOZE), 5, a
#define RPT0                             BANKMASK(ADRPT), 0, b
#define RPT1                             BANKMASK(ADRPT), 1, b
#define RPT2                             BANKMASK(ADRPT), 2, b
#define RPT3                             BANKMASK(ADRPT), 3, b
#define RPT4                             BANKMASK(ADRPT), 4, b
#define RPT5                             BANKMASK(ADRPT), 5, b
#define RPT6                             BANKMASK(ADRPT), 6, b
#define RPT7                             BANKMASK(ADRPT), 7, b
#define RSC1IE                           BANKMASK(I2C1PIE), 1, b
#define RSC1IF                           BANKMASK(I2C1PIR), 1, b
#define RSCIE                            BANKMASK(I2C1PIE), 1, b
#define RSCIF                            BANKMASK(I2C1PIR), 1, b
#define RSEN                             BANKMASK(I2C1CON0), 6, b
#define RST                              BANKMASK(SMT1STAT), 5, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define RXO                              BANKMASK(I2C1CON1), 2, b
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SC1IE                            BANKMASK(I2C1PIE), 0, b
#define SC1IF                            BANKMASK(I2C1PIR), 0, b
#define SCANEN                           BANKMASK(SCANCON0), 7, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE8), 7, a
#define SCANIF                           BANKMASK(PIR8), 7, a
#define SCANIP                           BANKMASK(IPR8), 7, b
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANPR0                          BANKMASK(SCANPR), 0, b
#define SCANPR1                          BANKMASK(SCANPR), 1, b
#define SCANPR2                          BANKMASK(SCANPR), 2, b
#define SCIE                             BANKMASK(I2C1PIE), 0, b
#define SCIF                             BANKMASK(I2C1PIR), 0, b
#define SCNT0                            BANKMASK(DMAnSCNTL), 0, b
#define SCNT1                            BANKMASK(DMAnSCNTL), 1, b
#define SCNT10                           BANKMASK(DMAnSCNTH), 2, b
#define SCNT11                           BANKMASK(DMAnSCNTH), 3, b
#define SCNT2                            BANKMASK(DMAnSCNTL), 2, b
#define SCNT3                            BANKMASK(DMAnSCNTL), 3, b
#define SCNT4                            BANKMASK(DMAnSCNTL), 4, b
#define SCNT5                            BANKMASK(DMAnSCNTL), 5, b
#define SCNT6                            BANKMASK(DMAnSCNTL), 6, b
#define SCNT7                            BANKMASK(DMAnSCNTL), 7, b
#define SCNT8                            BANKMASK(DMAnSCNTH), 0, b
#define SCNT9                            BANKMASK(DMAnSCNTH), 1, b
#define SDAHT0                           BANKMASK(I2C1CON2), 2, b
#define SDAHT1                           BANKMASK(I2C1CON2), 3, b
#define SEL0                             BANKMASK(HLVDCON1), 0, b
#define SEL1                             BANKMASK(HLVDCON1), 1, b
#define SEL2                             BANKMASK(HLVDCON1), 2, b
#define SEL3                             BANKMASK(HLVDCON1), 3, b
#define SGO                              BANKMASK(SCANCON0), 5, b
#define SHADLO                           BANKMASK(SHADCON), 0, b
#define SHFT0                            BANKMASK(CRCSHIFTL), 0, b
#define SHFT1                            BANKMASK(CRCSHIFTL), 1, b
#define SHFT10                           BANKMASK(CRCSHIFTH), 2, b
#define SHFT11                           BANKMASK(CRCSHIFTH), 3, b
#define SHFT12                           BANKMASK(CRCSHIFTH), 4, b
#define SHFT13                           BANKMASK(CRCSHIFTH), 5, b
#define SHFT14                           BANKMASK(CRCSHIFTH), 6, b
#define SHFT15                           BANKMASK(CRCSHIFTH), 7, b
#define SHFT2                            BANKMASK(CRCSHIFTL), 2, b
#define SHFT3                            BANKMASK(CRCSHIFTL), 3, b
#define SHFT4                            BANKMASK(CRCSHIFTL), 4, b
#define SHFT5                            BANKMASK(CRCSHIFTL), 5, b
#define SHFT6                            BANKMASK(CRCSHIFTL), 6, b
#define SHFT7                            BANKMASK(CRCSHIFTL), 7, b
#define SHFT8                            BANKMASK(CRCSHIFTH), 0, b
#define SHFT9                            BANKMASK(CRCSHIFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SIRQ0                            BANKMASK(DMAnSIRQ), 0, b
#define SIRQ1                            BANKMASK(DMAnSIRQ), 1, b
#define SIRQ2                            BANKMASK(DMAnSIRQ), 2, b
